app/Http/Controllers/Member/Customer_InvoiceController.php

    public function index()
    {
        Session::forget('est_item');

        $data["serial"] = ItemSerial::check_setting();

        $data["page"]       = "Customer Invoice";
        $data["pis"]        = Purchasing_inventory_system::check();
        //dd($data["pis"]);
        $data["_customer"]  = Customer::getAllCustomer();
        $data["_terms"]     = Customer::getTerms($this->user_info->shop_id,0);

        $data['_item']      = Item::get_all_category_item();
        $data['_cm_item']   = Item::get_returnable_item();

        $data['_um']        = UnitMeasurement::load_um_multi();
        $data["action"]     = "/member/customer/invoice/create";
        $data["new_inv_id"] = Transaction::get_last_number("tbl_customer_invoice","new_inv_id","inv_shop_id");
        $data["c_id"] = Request::input("customer_id");
        $data["_estimate"] = Tbl_customer_estimate::where("est_customer_id",$data["c_id"])->where("est_status",'accepted')->get();
        $id = Request::input('id');
        if($id)
        {
            $data["inv"]            = Tbl_customer_invoice::where("inv_id", $id)->first();
---
select * from `tbl_customer_estimate` where `est_customer_id` = '464' and `est_status` = 'accepted'
select * from `tbl_customer_invoice` where `inv_id` = '93' limit 1


            // dd($data["inv"]);

            $sir = Tbl_manual_invoice::where("inv_id",$id)->first();
---
select * from `tbl_manual_invoice` where `inv_id` = '93' limit 1

    public function invoice_list()
    {
        $data["_invoices"] = Tbl_customer_invoice::manual_invoice()->customer()->orderBy("tbl_customer_invoice.inv_id","DESC")->where("inv_shop_id",$this->user_info->shop_id)
            ->where("is_sales_receipt",0)->get();
        $data["_invoices_unpaid"] = Tbl_customer_invoice::manual_invoice()->customer()->orderBy("tbl_customer_invoice.inv_id","DESC")->where("inv_shop_id",$this->user_info->shop_id)
            ->where("is_sales_receipt",0)->where("inv_is_paid",0)->get();

        $data["_invoices_paid"] = Tbl_customer_invoice::manual_invoice()->customer()->orderBy("tbl_customer_invoice.inv_id","DESC")->where("inv_shop_id",$this->user_info->shop_id)
            ->where("is_sales_receipt",0)->where("inv_is_paid",1)->get();

        foreach ($data["_invoices"] as $key => $value)
        {
            $orig_price = $value->inv_overall_price;
            $cm = Tbl_credit_memo::where("cm_id",$value->credit_memo_id)->first();
---
select * from `tbl_credit_memo` where `cm_id` = '0' limit 1

                $item_info[$key]['ref_name']           = Request::input('invline_ref_name')[$key];
                $item_info[$key]['ref_id']             = Request::input('invline_ref_id')[$key];

                $item_type = Tbl_item::where("item_id",Request::input('invline_item_id')[$key])->value("item_type_id");
---
select `item_type_id` from `tbl_item` where `item_id` = '434' limit 1