app/Http/Controllers/Member/Customer_EstimateController.php

    public function load_all($customer_id)
    {
        $data["_estimate"] = Tbl_customer_estimate::where("est_customer_id",$customer_id)->where("est_status",'accepted')->where("is_sales_order",0)->get();
        $data["_so"] = Tbl_customer_estimate::where("est_customer_id",$customer_id)->where("est_status",'accepted')->where("is_sales_order",1)->get();
---
select * from `tbl_customer_estimate` where `est_customer_id` = '464' and `est_status` = 'accepted' and `is_sales_order` = '0'
select * from `tbl_customer_estimate` where `est_customer_id` = '464' and `est_status` = 'accepted' and `is_sales_order` = '1'