app/Http/Controllers/Member/InventoryLogController.php

select * from `tbl_inventory_slip` inner join `tbl_warehouse_inventory` on `tbl_warehouse_inventory`.`inventory_slip_id` = `tbl_inventory_slip`.`inventory_slip_id` inner join `tbl_item` on `tbl_item`.`item_id` = `tbl_warehouse_inventory`.`inventory_item_id` where `tbl_inventory_slip`.`warehouse_id` = '53' and `inventory_slip_shop_id` = '13' and `inventory_count` != '0' order by `inventory_slip_date` desc
---
    public function index()
    {
        $warehouse_id = $this->current_warehouse->warehouse_id;
        $data["_slip"] = Tbl_inventory_slip::where("tbl_inventory_slip.warehouse_id",$warehouse_id)
                        ->where("inventory_slip_shop_id",$this->user_info->shop_id)
                        ->join('tbl_warehouse_inventory', 'tbl_warehouse_inventory.inventory_slip_id', '=', 'tbl_inventory_slip.inventory_slip_id')
                        ->join('tbl_item', 'tbl_item.item_id', '=', 'tbl_warehouse_inventory.inventory_item_id')
                        ->where('inventory_count', '!=', 0);

        $item_search = Request::input('item');
        $filter_search = Request::input('filter');
        if($item_search)
        {
            $data["_slip"] =  $data["_slip"]->where(DB::raw("CONCAT(tbl_item.item_name, ' ', tbl_item.item_sku)"), 'LIKE', "%".$item_search."%");
        }
        if($filter_search)
        {
            if($filter_search != 'all')
            {
                $data["_slip"] =  $data["_slip"]->where('inventory_reason', '=', $filter_search);
            }
        }
        $data["_slip"] =  $data["_slip"]->orderBy("inventory_slip_date","DESC")->get();