app/Http/Controllers/Member/ItemSerialController.php

select * from `tbl_item` where `item_id` = '434' limit 1
---
    public function view_serial($item_id)
    {
        $data["item_name"] = Tbl_item::where("item_id",$item_id)->first();