app/Http/Controllers/Member/Member.php

select * from `tbl_user_position` where `position_id` = '1' limit 1
---
						Settings::set_currency_default($this->user_info->shop_id);

						$shop_id_used    = $user_info->shop_id;
						$check_if_dev    = Tbl_user_position::where("position_id",$this->user_info->user_level)->first();

select * from `tbl_user_warehouse_access` where `user_id` = '40' and `warehouse_id` is null limit 1
select * from `tbl_warehouse` where `warehouse_shop_id` = '13' and `warehouse_id` is null limit 1
---
						}


						$check_warehouse = Tbl_user_warehouse_access::where("user_id",$user_info->user_id)->where("warehouse_id",session("warehouse_id_".$shop_id_used))->first();
						if($is_dev == 1)
						{
							$check_session = session("warehouse_id_".$shop_id_used);
							$check_exist   = Tbl_warehouse::where("warehouse_shop_id",$shop_id_used)->where("warehouse_id",$check_session)->first();