app/Http/Controllers/Member/PurchasingInventorySystemController.php

    public function pis_counter()
    {
        $return["lof_ctr"] = 0;
        $return["sir_ctr"] = 0;
        $return["ilr_ctr"] = 0;
        $return["col_ctr"] = 0;
        $return["inv_ctr"] = 0;
        $return["po_ctr"] = 0;
        $return["bill_ctr"] = 0;
        if(Purchasing_inventory_system::check() != 0)
        {
            $return["lof_ctr"] = Tbl_sir::where("shop_id",Purchasing_inventory_system::getShopId())->whereIn("lof_status",[1,3])->count();
            $return["sir_ctr"] = Tbl_sir::where("shop_id",Purchasing_inventory_system::getShopId())->where("reload_sir",1)->count();
            $return["ilr_ctr"] = Tbl_sir::where("shop_id",Purchasing_inventory_system::getShopId())->where("ilr_status",1)->count();

            $return["col_ctr"] = Tbl_sir::where("shop_id",Purchasing_inventory_system::getShopId())->where("ilr_status",1)->count();

            $return["inv_ctr"] = Tbl_customer_invoice::where("inv_shop_id",Purchasing_inventory_system::getShopId())->where("inv_is_paid",0)->count();

            $return["po_ctr"] = Tbl_purchase_order::where("po_shop_id",Purchasing_inventory_system::getShopId())->where("po_is_billed",0)->count();

            $return["bill_ctr"] = Tbl_bill::where("bill_shop_id",Purchasing_inventory_system::getShopId())->where("bill_is_paid",0)->count();
---
select count(*) as aggregate from `tbl_sir` where `shop_id` = '13' and `lof_status` in ('1', '3')
select count(*) as aggregate from `tbl_sir` where `shop_id` = '13' and `reload_sir` = '1'
select count(*) as aggregate from `tbl_sir` where `shop_id` = '13' and `ilr_status` = '1'
select count(*) as aggregate from `tbl_customer_invoice` where `inv_shop_id` = '13' and `inv_is_paid` = '0'
select count(*) as aggregate from `tbl_purchase_order` where `po_shop_id` = '13' and `po_is_billed` = '0'
select count(*) as aggregate from `tbl_bill` where `bill_shop_id` = '13' and `bill_is_paid` = '0'

    public function create_sir()
    {
        $access = Utilities::checkAccess("pis-sir","add");
        if($access != 0)
        {
            $data["_truck"] = Tbl_truck::where("archived",0)->where("truck_shop_id",$this->user_info->shop_id)->get();
---
select * from `tbl_truck` where `archived` = '0' and `truck_shop_id` = '13'

        }
        foreach ($item_id as $key_item => $value_item)
        {
            $type = Tbl_item::where("item_id",$value_item)->value("item_type_id");
---
select `item_type_id` from `tbl_item` where `item_id` = '434' limit 1

            $i = null;
            foreach ($item_id as $value_itemid)
            {
                $type = Tbl_item::where("item_id",$value_itemid)->value("item_type_id");
---
select `item_type_id` from `tbl_item` where `item_id` = '434' limit 1

                    }
                    else
                    {
                        $item_name = Tbl_item::where("item_id",$value["id"])->value("item_name");
---
select `item_name` from `tbl_item` where `item_id` = '434' limit 1