app/Http/Controllers/Member/SettingsController.php

select * from `tbl_settings` where `shop_id` = '13'
select * from `tbl_settings` where `shop_id` = '13' and `settings_key` = 'terms_and_agreement' limit 1
---
    public function all()
    {
        $shop_id = $this->user_info->shop_id;
        $data['settings_setup'] = $this->setup();
        $data['selected_settings'] = 'all';
        $settings_active = Tbl_settings::where('shop_id', $shop_id)->get();
        $settings_active = Tbl_settings::where('shop_id', $shop_id)->get();
        $data['settings_active'] = [];
        foreach($settings_active as $settings)
        {
            $data['settings_active'][$settings->settings_key]['settings_value'] = $settings->settings_value;
            $data['settings_active'][$settings->settings_key]['settings_setup_done'] = $settings->settings_setup_done;
        }
        $data['terms_and_agreement'] = Tbl_settings::where('shop_id', $shop_id)->where('settings_key', 'terms_and_agreement')->first();

select * from `currency`
select * from `tbl_country`
---
    public function setup()
    {
        // Set your required data here
        $data['currency'] = Currency::get();
        $data['country'] =  Tbl_country::get();