app/Http/Controllers/Member/WarehouseController.php

select * from `tbl_user_warehouse_access` where `user_id` = '40' and `warehouse_id` = '53' limit 1
---
    public function index()
    {
        $this->item();
        $access = Utilities::checkAccess('item-warehouse', 'access_page');
        if($access == 1)
        {
            $data["_warehouse"] = Tbl_warehouse::select_info($this->user_info->shop_id, 0)->orderBy('warehouse_created', 'DESC')->groupBy("tbl_warehouse.warehouse_id");
            if(Request::input("search_txt"))
            {
               $data["_warehouse"]->where("warehouse_name","LIKE","%".Request::input("search_txt")."%");
            }
            $data["_warehouse"] = $data["_warehouse"]->paginate(10);
            // $data["_warehouse_archived"] = Tbl_warehouse::inventory()->select_info($this->user_info->shop_id, 1)->groupBy("tbl_warehouse.warehouse_id")->get();

            $all_item = null;
            foreach($data["_warehouse"] as $key => $value)
            {
                $check_if_owned = Tbl_user_warehouse_access::where("user_id",$this->user_info->user_id)->where("warehouse_id",$value->warehouse_id)->first();

select `settings_value` from `tbl_settings` where `shop_id` = '13' and `settings_key` = 'item_serial' limit 1
---
            //     }
            // }
            $data["_warehouse_archived"] = null;
            $data["enable_serial"] = Tbl_settings::where("shop_id",$this->user_info->shop_id)->where("settings_key","item_serial")->value("settings_value");

select * from `tbl_warehouse` where `main_warehouse` = '0' and `warehouse_shop_id` = '13'
---
    public function item()
    {
        $not_mainwarehouse = Tbl_warehouse::where("main_warehouse",0)->where("warehouse_shop_id",$this->user_info->shop_id)->get();

select * from `tbl_user_warehouse_access` inner join `tbl_warehouse` on `tbl_warehouse`.`warehouse_id` = `tbl_user_warehouse_access`.`warehouse_id` where `user_id` = '40' and `archived` = '0'
---
    public function load_warehouse()
    {
        $access = Utilities::checkAccess('item-warehouse', 'access_page');
        if($access == 1)
        {
            if(Request::input("id"))
            {
                $data = Tbl_user_warehouse_access::join("tbl_warehouse","tbl_warehouse.warehouse_id","=","tbl_user_warehouse_access.warehouse_id")->where("user_id",$this->user_info->user_id)->where("archived",0)->where("tbl_warehouse.warehouse_id","!=",Request::input("id"))->get();

select * from `tbl_warehouse_inventory` where `inventory_id` = '8240' limit 1
select * from `tbl_item` where `item_id` = '434' limit 1
---
    public function add_serial_number()
    {
        $access = Utilities::checkAccess('item-warehouse', 'add-serial');
        if($access == 1)
        {
            $items = Session::get("item");

            if(Request::input("inventory_id"))
            {
                $details = Tbl_warehouse_inventory::where("inventory_id",Request::input("inventory_id"))->first();
                $for_serial_item[$details->inventory_item_id]["quantity"] = $details->inventory_count;
                $for_serial_item[$details->inventory_item_id]["product_id"] = $details->inventory_item_id;
                $for_serial_item[$details->inventory_item_id]["inventory_id"] = $details->inventory_id;

                $items["item_list"] = $for_serial_item;
            }

            $data["items"] = null;
            // $data["slip_id"] = $item["slip_id"];
            foreach ($items["item_list"] as $key => $value)
            {
                $data["items"][$key] = Tbl_item::where("item_id",$key)->first();

select * from `tbl_item` where `archived` = '0' and `item_type_id` = '1' and `shop_id` = '13'
---
    public function load_item()
    {
        $access = Utilities::checkAccess('item-warehouse', 'access_page');
        if($access == 1)
        {
            $data = Tbl_item::where("archived",0)->where("item_type_id",1)->where("shop_id",$this->user_info->shop_id)->get();