app/Http/Controllers/Shop/Shop.php

    public function __construct()
    {
    	$domain = get_domain();
        $data['lead'] = null;
        $data['lead_code'] = null;
        $data['customer_info'] = null;
    	$check_domain = Tbl_shop::where("shop_domain", $domain)->first();

        if(hasSubdomain())
        {
            if (isset($_SERVER['HTTP_HOST']))
            {
                $url = $_SERVER['HTTP_HOST'];
            }
            else
            {
                $url = $_SERVER['SERVER_NAME'];
            }

			$host = explode('.', $url);
			$subdomains = array_slice($host, 0, count($host) - 2 );
			$subdomain = $subdomains[0];
        	$this->shop_info = $shop_info = Tbl_shop::where("shop_key", $subdomain)->first();
---
select * from `tbl_shop` where `shop_domain` = 'digimahouse.dev' limit 1
select * from `tbl_shop` where `shop_key` = 'sample' limit 1