app/Http/Controllers/Login/MemberLoginController.php

	public function login()
	{

		$shop_id = Settings::get_shop_id_url();
		$data['shop_id'] = $shop_id;
		if($shop_id != null)
		{
			$data['shop_info'] = Tbl_shop::where('shop_id', $shop_id)->first();
			$data['company_logo']    = DB::table('tbl_content')->where('shop_id', $shop_id)->where('key', 'receipt_logo')->value('value');
		}
		Session::forget('product_info');
		// return Crypt::decrypt('eyJpdiI6InJJUjR1NFlvVURmWURPajBMdnpldXc9PSIsInZhbHVlIjoidGJPRTRmRHZkTkNKZENSU2lWZ3p2UT09IiwibWFjIjoiY2VhNTU2OTMzNTE0OTE0YzMzOGIyMzE5Y2VjY2NhZDgzMDcwNmI5ZTgyZjNmYTUwOWEwZTQ0MDA4M2ZkMGMxOCJ9');
		if(Request::isMethod("post"))
		{
			$user_info = Tbl_user::where("user_email", Request::input("email"))->first();
---
select * from `tbl_user` where `user_email` = 'payroll@dmsph.com' limit 1