app/Globals/Account.php

    public static function put_default_account($shop)
    {

        $is_account_has_data = Tbl_chart_of_account::accountInfo($shop)->count();
        $count_defualt       = Tbl_default_chart_account::count();
        $shop_id             = Tbl_shop::where("shop_id", $shop)->orWhere("shop_key")->value("shop_id");
---
select `shop_id` from `tbl_shop` where `shop_id` = '13' or `shop_key` is null limit 1