app/Globals/AuditTrail.php

insert into `tbl_audit_trail` (`user_id`, `remarks`, `source`, `source_id`, `old_data`, `new_data`, `audit_shop_id`, `created_at`) values ('55', 'Logged In', '', '0', '', '', '22', '2017-09-06 13:10:31')
---
    public static function record_logs($action ="", $source="", $source_id = 0 , $old_data ="" , $new_data="")
    {
        $insert_log["user_id"] = AuditTrail::getUser();
    	$insert_log["remarks"] = $action;
    	$insert_log["source"] = $source;
    	$insert_log["source_id"] = $source_id;
    	$insert_log["old_data"] = $old_data;
    	$insert_log["new_data"] = $new_data;
        $insert_log["audit_shop_id"] = AuditTrail::getShopId();
        $insert_log["created_at"] = Carbon::now();

        if($insert_log["user_id"])
        {
    		$id = Tbl_audit_trail::insertGetId($insert_log);