app/Globals/Ecom_Product.php

select * from `tbl_ec_product` where `eprod_shop_id` = '7' and `archived` = '0'
---
	public static function getAllProduct($shop_id = null, $manufacturer_id = null)
	{
		if(!$shop_id)
		{
			$shop_id = Ecom_Product::getShopId();
		}
		$_product = Tbl_ec_product::where("eprod_shop_id", $shop_id)->where("archived", 0)->get()->toArray();

select * from `tbl_category` where `type_shop` = '7' and `type_parent_id` = '0' and `tbl_category`.`archived` = '0'
select count(*) as aggregate from `tbl_ec_product` where `eprod_category_id` = '103' and `archived` = '0'
---
	public static function getCategoryPerSub($shop_id, $category_id, $ctr)
	{
		$_category = Tbl_category::where("type_shop", $shop_id)->where("type_parent_id", $category_id)->where("tbl_category.archived",0);
		if($shop_id == 1)
		{
			$_category = $_category->orderBy('type_name','asc');
		}
		$_category = $_category->get()->toArray();

		foreach($_category as $key=>$category)
		{
			$_category[$key]["product_count"]	= Tbl_ec_product::where("eprod_category_id", $category["type_id"])->where("archived",0)->count();