app/Globals/Invoice.php

            $transaction_type = "invoice";
            $transaction = "invoice";
        }
        $invoice_id = Tbl_customer_invoice::insertGetId($insert);
---
insert into `tbl_customer_invoice` (`inv_shop_id`, `inv_customer_id`, `inv_customer_email`, `new_inv_id`, `inv_customer_billing_address`, `inv_terms_id`, `inv_date`, `inv_due_date`, `inv_subtotal_price`, `ewt`, `inv_discount_type`, `inv_discount_value`, `taxable`, `inv_overall_price`, `inv_message`, `inv_memo`, `date_created`) values ('13', '464', '', '5', 'tesdfsdf', '49', '2017-08-17', '2017-08-27', '6.58', '0', 'percent', '', '0', '6.58', '', '', '2017-08-17 10:39:48')