app/Globals/ItemSerial.php

select * from `tbl_settings` where `settings_key` = 'item_serial' and `settings_value` = 'enable' and `shop_id` = '13' limit 1
---
    public static function check_setting()
    {
    	return Tbl_settings::where("settings_key","item_serial")->where("settings_value",'enable')->where("shop_id",ItemSerial::getShopId())->first();

select * from `tbl_inventory_serial_number` where `consume_source` = 'invoice' and `consume_source_id` = '93' and `item_id` = '434'
---
    public static function get_consume_serial($source_reason = "", $source_id = 0, $item_id = 0)
    {
		$serials = Tbl_inventory_serial_number::where("consume_source",$source_reason)->where("consume_source_id",$source_id)->where("item_id",$item_id)->get();