app/Globals/Mlm_discount.php

	public static function get_discount_all_membership($shop_id, $item_id, $data_type = null)
	{
		$all_membership = Tbl_membership::where('shop_id', $shop_id)->where('membership_archive', 0)->get();
		$item = Tbl_item::where('item_id', $item_id)->first();
---
select * from `tbl_membership` where `shop_id` = '7' and `membership_archive` = '0'
select * from `tbl_item` where `item_id` = '519' limit 1