app/Globals/Mlm_report.php

select * from `tbl_mlm_plan` where `shop_id` = '1' and `marketing_plan_enable` = '1' and `marketing_plan_trigger` = 'Slot Creation'
---
    public static function cashflow($shop_id, $filter)
    {

        $complan_per_day =Tbl_mlm_slot_wallet_log::slot()
        // ->leftjoin('tbl_mlm_plan', 'tbl_mlm_plan.marketing_plan_code', '=','tbl_mlm_slot_wallet_log.wallet_log_plan')
        ->customer()
        ->where('tbl_mlm_slot_wallet_log.shop_id', $shop_id)
        ->orderBy('wallet_log_date_created', 'DESC')

        ->select(DB::raw('wallet_log_date_created as wallet_log_date_created'), DB::raw('wallet_log_plan as wallet_log_plan'), DB::raw('sum(wallet_log_amount ) as wallet_log_amount'), DB::raw('wallet_log_slot as wallet_log_slot'))
        ->groupBy(DB::raw('wallet_log_plan') )
        ->groupBy('wallet_log_date_created')
        // -----------------------------------Filter
        ->where('wallet_log_date_created', '>=', $filter['from'])
        ->where('wallet_log_date_created', '<=', $filter['to'])
        ->skip($filter['skip'])
        ->take($filter['take'])
        // -----------------------------------End
        ->get();

        $plan_settings = Tbl_mlm_plan::where('shop_id', $shop_id)
            ->where('marketing_plan_enable', 1)
            ->where('marketing_plan_trigger', 'Slot Creation')
            ->get()->keyBy('marketing_plan_code');

select * from `tbl_warehouse` where `warehouse_shop_id` = '1' and `archived` = '0'
select sum(`total`) as aggregate from `tbl_ec_order` where `shop_id` = '1' and `created_date` >= '2017-08-31 00:00:00' and `created_date` <= '2017-09-01 00:00:00' and `payment_status` = '1'
select sum(`total`) as aggregate from `tbl_ec_order` where `shop_id` = '1' and `created_date` <= '2017-09-01 00:00:00' and `payment_status` = '1'
select sum(`wallet_log_refill_amount_paid`) as aggregate from `tbl_mlm_slot_wallet_log_refill` where `tbl_mlm_slot_wallet_log_refill`.`shop_id` = '1' and `wallet_log_refill_date` >= '2017-08-31 00:00:00' and `wallet_log_refill_date` <= '2017-09-01 00:00:00' and `wallet_log_refill_attachment_warehouse` = '6'
select sum(`wallet_log_refill_amount_paid`) as aggregate from `tbl_mlm_slot_wallet_log_refill` where `tbl_mlm_slot_wallet_log_refill`.`shop_id` = '1' and `wallet_log_refill_date` <= '2017-09-01 00:00:00' and `wallet_log_refill_attachment_warehouse` = '6'
select sum(`merchant_school_i_amount`) as aggregate from `tbl_merchant_school_item` where `merchant_school_item_shop` = '1' and `merchant_item_date` >= '2017-08-31 00:00:00' and `merchant_item_date` <= '2017-09-01 00:00:00'
select sum(`merchant_school_i_amount`) as aggregate from `tbl_merchant_school_item` where `merchant_school_item_shop` = '1' and `merchant_item_date` <= '2017-09-01 00:00:00'
select sum(`wallet_log_refill_amount_paid`) as aggregate from `tbl_mlm_slot_wallet_log_refill` where `tbl_mlm_slot_wallet_log_refill`.`shop_id` = '1' and `wallet_log_refill_date` >= '2017-08-31 00:00:00' and `wallet_log_refill_date` <= '2017-09-01 00:00:00' and `wallet_log_refill_attachment_warehouse` = '3'
select sum(`wallet_log_refill_amount_paid`) as aggregate from `tbl_mlm_slot_wallet_log_refill` where `tbl_mlm_slot_wallet_log_refill`.`shop_id` = '1' and `wallet_log_refill_date` <= '2017-09-01 00:00:00' and `wallet_log_refill_attachment_warehouse` = '3'
select sum(`membership_total`) as aggregate from `tbl_membership_code_invoice` where `shop_id` = '1' and `membership_code_date_created` >= '2017-08-31 00:00:00' and `membership_code_date_created` <= '2017-09-01 00:00:00'
select sum(`membership_total`) as aggregate from `tbl_membership_code_invoice` where `shop_id` = '1' and `membership_code_date_created` <= '2017-09-01 00:00:00'
select sum(`wallet_log_refill_amount_paid`) as aggregate from `tbl_mlm_slot_wallet_log_refill` where `tbl_mlm_slot_wallet_log_refill`.`shop_id` = '1' and `wallet_log_refill_date` >= '2017-08-31 00:00:00' and `wallet_log_refill_date` <= '2017-09-01 00:00:00' and `wallet_log_refill_attachment_warehouse` = '0'
select sum(`wallet_log_refill_amount_paid`) as aggregate from `tbl_mlm_slot_wallet_log_refill` where `tbl_mlm_slot_wallet_log_refill`.`shop_id` = '1' and `wallet_log_refill_date` <= '2017-09-01 00:00:00' and `wallet_log_refill_attachment_warehouse` = '0'
select sum(`wallet_log_transfer_slot_trans`) as aggregate from `tbl_mlm_slot_wallet_log_transfer` where `tbl_mlm_slot_wallet_log_transfer`.`shop_id` = '1' and `wallet_log_transfer_date` >= '2017-08-31 00:00:00' and `wallet_log_transfer_date` <= '2017-09-01 00:00:00'
select sum(`wallet_log_transfer_slot_trans`) as aggregate from `tbl_mlm_slot_wallet_log_transfer` where `tbl_mlm_slot_wallet_log_transfer`.`shop_id` = '1' and `wallet_log_transfer_date` <= '2017-09-01 00:00:00'
select sum(`tour_wallet_logs_wallet_amount`) as aggregate from `tbl_tour_wallet_logs` inner join `tbl_customer` on `tbl_customer`.`customer_id` = `tbl_tour_wallet_logs`.`tour_wallet_logs_customer_id` where `tbl_customer`.`shop_id` = '1' and `tour_wallet_logs_date` >= '2017-08-31 00:00:00' and `tour_wallet_logs_date` <= '2017-09-01 00:00:00' group by `tour_wallet_logs_id`
select sum(`tour_wallet_logs_wallet_amount`) as aggregate from `tbl_tour_wallet_logs` inner join `tbl_customer` on `tbl_customer`.`customer_id` = `tbl_tour_wallet_logs`.`tour_wallet_logs_customer_id` where `tbl_customer`.`shop_id` = '1' and `tour_wallet_logs_date` <= '2017-09-01 00:00:00' group by `tour_wallet_logs_id`
---
    public static function warehouse_consiladated($shop_id, $filters)
    {
            $all_warehouse = Tbl_warehouse::where('warehouse_shop_id', $shop_id)->where('archived', 0)->get();
            $g_total = 0;
            foreach($all_warehouse as $key => $value)
            {
                $membership = 0;
                $product = 0;
                $e_wallet_refill = 0;
                $e_wallet_transfer = 0;
                $e_wallet_tours = 0;
                $e_wallet_school = 0;

                if($value->main_warehouse == 2)
                {
                    $product = Tbl_ec_order::where('shop_id', $shop_id)
                    ->where('created_date', '>=', $filters['from'])
                    ->where('created_date', '<=', $filters['to'])
                    ->where('payment_status', 1)
                    ->sum('total');

                    $g_total += Tbl_ec_order::where('shop_id', $shop_id)
                    ->where('created_date', '<=', $filters['to'])
                    ->where('payment_status', 1)
                    ->sum('total');

                    $e_wallet_refill = Tbl_mlm_slot_wallet_log_refill::where('tbl_mlm_slot_wallet_log_refill.shop_id', $shop_id)
                    ->where('wallet_log_refill_date', '>=', $filters['from'])
                    ->where('wallet_log_refill_date', '<=', $filters['to'])
                    ->where('wallet_log_refill_attachment_warehouse', $value->warehouse_id)
                    ->sum('wallet_log_refill_amount_paid');

                    $g_total += Tbl_mlm_slot_wallet_log_refill::where('tbl_mlm_slot_wallet_log_refill.shop_id', $shop_id)
                    ->where('wallet_log_refill_date', '<=', $filters['to'])
                    ->where('wallet_log_refill_attachment_warehouse', $value->warehouse_id)
                    ->sum('wallet_log_refill_amount_paid');

                    $e_wallet_school = DB::table('tbl_merchant_school_item')->where('merchant_school_item_shop', $shop_id)
                    ->where('merchant_item_date', '>=', $filters['from'])
                    ->where('merchant_item_date', '<=', $filters['to'])
                    ->sum('merchant_school_i_amount');

                    $g_total += DB::table('tbl_merchant_school_item')->where('merchant_school_item_shop', $shop_id)
                    ->where('merchant_item_date', '<=', $filters['to'])
                    ->sum('merchant_school_i_amount');
                }
                else
                {
                    $e_wallet_refill = Tbl_mlm_slot_wallet_log_refill::where('tbl_mlm_slot_wallet_log_refill.shop_id', $shop_id)
                    ->where('wallet_log_refill_date', '>=', $filters['from'])
                    ->where('wallet_log_refill_date', '<=', $filters['to'])
                    ->where('wallet_log_refill_attachment_warehouse', $value->warehouse_id)
                    ->sum('wallet_log_refill_amount_paid');

                    $g_total += Tbl_mlm_slot_wallet_log_refill::where('tbl_mlm_slot_wallet_log_refill.shop_id', $shop_id)
                    ->where('wallet_log_refill_date', '<=', $filters['to'])
                    ->where('wallet_log_refill_attachment_warehouse', $value->warehouse_id)
                    ->sum('wallet_log_refill_amount_paid');

                    if($value->main_warehouse == 1)
                    {
                        $membership = Tbl_membership_code_invoice::where('shop_id', $shop_id)
                        ->where('membership_code_date_created', '>=', $filters['from'])
                        ->where('membership_code_date_created', '<=', $filters['to'])
                        ->sum('membership_total');

                        $g_total += Tbl_membership_code_invoice::where('shop_id', $shop_id)
                        ->where('membership_code_date_created', '<=', $filters['to'])
                        ->sum('membership_total');

                        $e_wallet_refill = $e_wallet_refill +  Tbl_mlm_slot_wallet_log_refill::where('tbl_mlm_slot_wallet_log_refill.shop_id', $shop_id)
                        ->where('wallet_log_refill_date', '>=', $filters['from'])
                        ->where('wallet_log_refill_date', '<=', $filters['to'])
                        ->where('wallet_log_refill_attachment_warehouse', 0)
                        ->sum('wallet_log_refill_amount_paid');

                        $g_total += Tbl_mlm_slot_wallet_log_refill::where('tbl_mlm_slot_wallet_log_refill.shop_id', $shop_id)
                        ->where('wallet_log_refill_date', '<=', $filters['to'])
                        ->where('wallet_log_refill_attachment_warehouse', 0)
                        ->sum('wallet_log_refill_amount_paid');

                        $e_wallet_transfer = Tbl_mlm_slot_wallet_log_transfer::where('tbl_mlm_slot_wallet_log_transfer.shop_id', $shop_id)
                        ->where('wallet_log_transfer_date', '>=', $filters['from'])
                        ->where('wallet_log_transfer_date', '<=', $filters['to'])
                        ->sum('wallet_log_transfer_slot_trans');

                        $g_total += Tbl_mlm_slot_wallet_log_transfer::where('tbl_mlm_slot_wallet_log_transfer.shop_id', $shop_id)
                        ->where('wallet_log_transfer_date', '<=', $filters['to'])
                        ->sum('wallet_log_transfer_slot_trans');

                        $e_wallet_tours = DB::table('tbl_tour_wallet_logs')
                        ->where('tbl_customer.shop_id', $shop_id)
                        ->join('tbl_customer', 'tbl_customer.customer_id', '=', 'tbl_tour_wallet_logs.tour_wallet_logs_customer_id')
                        ->groupBy('tour_wallet_logs_id')
                        ->where('tour_wallet_logs_date', '>=', $filters['from'])
                        ->where('tour_wallet_logs_date', '<=', $filters['to'])
                        ->sum('tour_wallet_logs_wallet_amount');

                        $g_total += DB::table('tbl_tour_wallet_logs')
                        ->where('tbl_customer.shop_id', $shop_id)
                        ->join('tbl_customer', 'tbl_customer.customer_id', '=', 'tbl_tour_wallet_logs.tour_wallet_logs_customer_id')
                        ->groupBy('tour_wallet_logs_id')
                        ->where('tour_wallet_logs_date', '<=', $filters['to'])
                        ->sum('tour_wallet_logs_wallet_amount');

select sum(`item_total`) as aggregate from `tbl_item_code_invoice` where `tbl_item_code_invoice`.`shop_id` = '1' and `item_code_date_created` >= '2017-08-31 00:00:00' and `item_code_date_created` <= '2017-09-01 00:00:00' and `warehouse_id` = '3'
select sum(`item_total`) as aggregate from `tbl_item_code_invoice` where `tbl_item_code_invoice`.`shop_id` = '1' and `item_code_date_created` <= '2017-09-01 00:00:00' and `warehouse_id` = '3'
---

                    }

                    $product = Tbl_item_code_invoice::where('tbl_item_code_invoice.shop_id', $shop_id)
                    ->where('item_code_date_created', '>=', $filters['from'])
                    ->where('item_code_date_created', '<=', $filters['to'])
                    ->where('warehouse_id', $value->warehouse_id)
                    ->sum('item_total');

                    $g_total += Tbl_item_code_invoice::where('tbl_item_code_invoice.shop_id', $shop_id)
                    ->where('item_code_date_created', '<=', $filters['to'])
                    ->where('warehouse_id', $value->warehouse_id)
                    ->sum('item_total');