app/Globals/Payroll.php

select count(*) as aggregate from `tbl_payroll_copy_log_requirements` where `shop_id` = '13' and `requirements_category` = 'tax'
---
	public static function tax_reference($shop_id = 0)
	{
		$count = Tbl_payroll_copy_log_requirements::where('shop_id',$shop_id)->where('requirements_category','tax')->count();

select * from `tbl_payroll_tax_period_default`
select count(*) as aggregate from `tbl_payroll_tax_period` where `shop_id` = '13' and `payroll_tax_period` = 'Daily'
---
	public static function generate_tax_period($shop_id = 0)
	{
		$_default = Tbl_payroll_tax_period_default::get();
		$insert = array();
		foreach($_default as $default)
		{
			$count = Tbl_payroll_tax_period::where('shop_id', $shop_id)->where('payroll_tax_period',$default->payroll_tax_period)->count();

select count(*) as aggregate from `tbl_payroll_copy_log_requirements` where `shop_id` = '13' and `requirements_category` = 'sss'
---
	public static function generate_sss($shop_id = 0)
	{
		$count = Tbl_payroll_copy_log_requirements::where('shop_id',$shop_id)->where('requirements_category','sss')->count();

select count(*) as aggregate from `tbl_payroll_copy_log_requirements` where `shop_id` = '13' and `requirements_category` = 'philhealth'
---
	public static function generate_philhealth($shop_id = 0)
	{
		$count = Tbl_payroll_copy_log_requirements::where('shop_id',$shop_id)->where('requirements_category','philhealth')->count();

select count(*) as aggregate from `tbl_payroll_copy_log_requirements` where `shop_id` = '13' and `requirements_category` = 'pagibig'
---
	public static function generate_pagibig($shop_id = 0)
	{

		$count = Tbl_payroll_copy_log_requirements::where('shop_id',$shop_id)->where('requirements_category','pagibig')->count();

select count(*) as aggregate from `tbl_payroll_copy_log_requirements` where `shop_id` = '13' and `requirements_category` = 'paper size'
---
	public static function generate_paper_size($shop_id = 0)
	{
		// Tbl_payroll_paper_sizes

		// $count = Tbl_payroll_paper_sizes::where('shop_id')->count();
		$count = Tbl_payroll_copy_log_requirements::where('shop_id',$shop_id)->where('requirements_category','paper size')->count();