app/Globals/Purchasing_inventory_system.php

select `settings_setup_done` from `tbl_settings` where `settings_key` = 'pis-jamestiong' and `settings_value` = 'enable' and `shop_id` = '13' limit 1
---
    public static function check($for_tablet = false)
    {
        $shop_id = Purchasing_inventory_system::getShopId();
        if($for_tablet == true)
        {
            $shop_id = Tablet_global::getShopId();
        }

        $check = Tbl_settings::where("settings_key","pis-jamestiong")->where("settings_value","enable")->where("shop_id",$shop_id)->value("settings_setup_done");

select *, count(tbl_sir_item.sir_id) as total_item, tbl_sir.created_at as sir_created,tbl_sir.sir_id as sir_id, tbl_sir.archived as sir_archived from `tbl_sir` left join `tbl_truck` on `tbl_truck`.`truck_id` = `tbl_sir`.`truck_id` left join `tbl_employee` on `tbl_employee`.`employee_id` = `tbl_sir`.`sales_agent_id` left join `tbl_sir_item` on `tbl_sir_item`.`sir_id` = `tbl_sir`.`sir_id` where `tbl_sir`.`shop_id` = '13' and `tbl_sir`.`sir_status` != '2' and `tbl_sir`.`sir_id` like '%%' and `tbl_sir`.`reload_sir` = '0' group by `tbl_sir`.`sir_id` order by `tbl_sir`.`sir_id` desc limit 10 offset 0
select count(*) as aggregate from `tbl_sir` left join `tbl_truck` on `tbl_truck`.`truck_id` = `tbl_sir`.`truck_id` left join `tbl_employee` on `tbl_employee`.`employee_id` = `tbl_sir`.`sales_agent_id` left join `tbl_sir_item` on `tbl_sir_item`.`sir_id` = `tbl_sir`.`sir_id` where `tbl_sir`.`shop_id` = '13' and `tbl_sir`.`sir_status` != '2' and `tbl_sir`.`sir_id` like '%%' and `tbl_sir`.`reload_sir` = '0' group by `tbl_sir`.`sir_id`
---
    public static function select_lof($shop_id = 0, $return = 'array',$srch_sir = '')
    {
        $data = Tbl_sir::truck()->saleagent()->sir_item()->where("tbl_sir.shop_id",$shop_id)
                                ->where("tbl_sir.sir_status","!=",2)
                                ->where("tbl_sir.sir_id",'like','%'.$srch_sir.'%')
                                ->where("tbl_sir.reload_sir",0)
                                ->orderBy("tbl_sir.sir_id","DESC")->paginate(10);

select `item_type_id` from `tbl_item` where `item_id` = '434' limit 1
select `item_price` from `tbl_item` where `item_id` = '434' limit 1
---
    public static function get_item_price($item_id)
    {
        $if_bundle = Tbl_item::where("item_id",$item_id)->value("item_type_id");

        $return_price = Tbl_item::where("item_id",$item_id)->value("item_price");

select `item_type_id` from `tbl_item` where `item_id` = '434' limit 1
select `item_cost` from `tbl_item` where `item_id` = '434' limit 1
---
    public static function get_item_cost($item_id)
    {
        $if_bundle = Tbl_item::where("item_id",$item_id)->value("item_type_id");

        $return_price = Tbl_item::where("item_id",$item_id)->value("item_cost");