app/Globals/Seed_manual.php

select * from `tbl_chart_account_type` limit 1
select * from `tbl_default_chart_account` limit 1
select * from `tbl_user_position` limit 1
select * from `tbl_item_type` limit 1
select * from `tbl_payroll_entity` limit 1
---
    public static function auto_seed()
    {
        if(!DB::table("tbl_chart_account_type")->first())
        {
          Seed_manual::seed_tbl_chart_account_type();
        }
        if(!DB::table("tbl_default_chart_account")->first())
        {
          Seed_manual::seed_tbl_default_chart_account();
        }
        if(!DB::table("tbl_user_position")->first())
        {
          Seed_manual::seed_tbl_user_position();
        }
        if(!DB::table("tbl_item_type")->first())
        {
          Seed_manual::seed_tbl_item_type();
        }

        if(!DB::table('tbl_payroll_entity')->first())