app/Globals/Utilities.php

                        $check_shop         = Tbl_user::where("user_email", session('user_email'))->shop()->value('user_shop');
                        if($check_shop)
                        {
                            $check_stairstep = Tbl_mlm_plan::where("marketing_plan_code","STAIRSTEP")->where("shop_id",$check_shop)->where("marketing_plan_enable","1")->first();
---
select * from `tbl_mlm_plan` where `marketing_plan_code` = 'STAIRSTEP' and `shop_id` = '12' and `marketing_plan_enable` = '1' limit 1