app/Http/Controllers/MemberController.php

    public function __construct()
    {
        $domain = Request::url();
        $check_expole = explode('//', $domain);
        if(count($check_expole) == 2 )
        {
            $check_expole_2 = explode('.', $check_expole[1]);
            $key = $check_expole_2[0];
            $check_domain = Tbl_shop::where('shop_key', $key)->first();
            $lead_e = null;
            if($check_domain == null)
            {
                $check_domain = Tbl_customer::where('mlm_username', $key)->first();
                $lead_e = $check_domain;

                if($check_domain == null)
                {
                    $key = 'myphone';
                    $check_domain = Tbl_shop::where('shop_key', $key)->first();
---
select * from `tbl_shop` where `shop_key` = 'digimahouse' limit 1
select * from `tbl_customer` where `mlm_username` = 'digimahouse' limit 1
select * from `tbl_shop` where `shop_key` = 'myphone' limit 1